{
  "locationsVisitOrder": [
    "orlando",
    "gran-canaria",
    "tenerife",
    "lanzarote",
    "gran-canaria-2",
    "porto",
    "lisbon",
    "lagos",
    "seville",
    "marseille",
    "nice",
    "lux",
    "paris",
    "mumbai",
    "mundiyambakkam",
    "bangalore",
    "mundiyambakkam-2",
    "new-york-city",
    "new-haven",
    "boston",
    "west-bridgewater",
    "mechanicsburg",
    "philadelphia",
    "mechanicsburg-2",
    "brussels",
    "amsterdam",
    "berlin",
    "stockholm",
    "copenhagen",
    "porto-2",
    "milan"
  ],
  "locations": {
    "orlando": {
      "name": "Orlando, Florida",
      "posts": [
        "2017-05-09",
        "2017-05-10",
        "2017-05-11"
      ]
    },
    "gran-canaria": {
      "name": "Gran Canaria, Canary Islands",
      "posts": [
        "2017-05-12",
        "2017-05-13",
        "2017-05-14",
        "2017-05-15"
      ]
    },
    "tenerife": {
      "name": "Tenerife, Canary Islands",
      "posts": [
        "2017-05-16",
        "2017-05-17",
        "2017-05-18"
      ]
    },
    "lanzarote": {
      "name": "Lanzarote, Canary Islands",
      "posts": [
        "2017-05-19",
        "2017-05-20"
      ]
    },
    "gran-canaria-2": {
      "name": "Gran Canaria, Canary Islands",
      "posts": [
        "2017-05-21"
      ]
    },
    "porto": {
      "name": "Porto, Portugal",
      "posts": [
        "2017-05-22",
        "2017-05-23",
        "2017-05-24",
        "2017-05-25",
        "2017-05-26",
        "2017-05-27",
        "2017-05-28"
      ]
    },
    "lisbon": {
      "name": "Lisbon, Portugal",
      "posts": [
        "2017-05-29",
        "2017-05-30",
        "2017-06-01",
        "2017-06-02"
      ]
    },
    "lagos": {
      "name": "Lagos, Portugal",
      "posts": [
        "2017-06-03",
        "2017-06-04",
        "2017-06-05",
        "2017-06-06",
        "2017-06-07"
      ]
    },
    "seville": {
      "name": "Seville, Spain",
      "posts": [
        "2017-06-08",
        "2017-06-09",
        "2017-06-10",
        "2017-06-11",
        "2017-06-12",
        "2017-06-13",
        "2017-06-14"
      ]
    },
    "marseille": {
      "name": "Marseille, France",
      "posts": [
        "2017-06-15",
        "2017-06-16",
        "2017-06-17"
      ]
    },
    "nice": {
      "name": "Nice, France",
      "posts": [
        "2017-06-18",
        "2017-06-19",
        "2017-06-20"
      ]
    },
    "lux": {
      "name": "Luxembourg City, Luxembourg",
      "posts": [
        "2017-06-21",
        "2017-06-22",
        "2017-06-23"
      ]
    },
    "paris": {
      "name": "Paris, France",
      "posts": [
        "2017-06-24",
        "2017-06-25",
        "2017-06-26",
        "2017-06-27",
        "2017-06-28"
      ]
    },
    "mumbai": {
      "name": "Mumbai, India",
      "posts": [
        "2017-06-29"
      ]
    },
    "mundiyambakkam": {
      "name": "Mundiyambakkam, India",
      "posts": [
        "2017-06-30",
        "2017-07-01",
        "2017-07-02",
        "2017-07-03",
        "2017-07-04",
        "2017-07-05",
        "2017-07-06",
        "2017-07-07",
        "2017-07-08",
        "2017-07-09"
      ]
    },
    "bangalore": {
      "name": "Bangalore, India",
      "posts": [
        "2017-07-10",
        "2017-07-11"
      ]
    },
    "mundiyambakkam-2": {
      "name": "Mundiyambakkam, India",
      "posts": [
        "2017-07-12",
        "2017-07-13",
        "2017-07-14",
        "2017-07-15",
        "2017-07-16",
        "2017-07-17"
      ]
    },
    "new-york-city": {
      "name": "New York City, New York",
      "posts": [
        "2017-07-18"
      ]
    },
    "new-haven": {
      "name": "New Haven, Connecticut",
      "posts": [
        "2017-07-19"
      ]
    },
    "boston": {
      "name": "Boston, Massachusetts",
      "posts": [
        "2017-07-20"
      ]
    },
    "west-bridgewater": {
      "name": "West Bridgewater, Massachusetts",
      "posts": [
        "2017-07-21",
        "2017-07-22"
      ]
    },
    "mechanicsburg": {
      "name": "Mechanicsburg, Pennsylvania",
      "posts": [
        "2017-07-23",
        "2017-07-24",
        "2017-07-25",
        "2017-07-26"
      ]
    },
    "philadelphia": {
      "name": "Philadelphia, Pennsylvania",
      "posts": [
        "2017-07-27",
        "2017-07-28"
      ]
    },
    "mechanicsburg-2": {
      "name": "Mechanicsburg, Pennsylvania",
      "posts": [
        "2017-07-29",
        "2017-07-30",
        "2017-07-31",
        "2017-08-01",
        "2017-08-02",
        "2017-08-03",
        "2017-08-04"
      ]
    },
    "brussels": {
      "name": "Brussels, Belgium",
      "posts": [
        "2017-08-05",
        "2017-08-06",
        "2017-08-07",
        "2017-08-08",
        "2017-08-09"
      ]
    },
    "amsterdam": {
      "name": "Amsterdam, Netherlands",
      "posts": [
        "2017-08-10",
        "2017-08-11",
        "2017-08-12"
      ]
    },
    "berlin": {
      "name": "Berlin, Germany",
      "posts": [
        "2017-08-13",
        "2017-08-14",
        "2017-08-15",
        "2017-08-16"
      ]
    },
    "stockholm": {
      "name": "Stockholm, Sweden",
      "posts": [
        "2017-08-17",
        "2017-08-18",
        "2017-08-19",
        "2017-08-20"
      ]
    },
    "copenhagen": {
      "name": "Copenhagen, Denmark",
      "posts": [
        "2017-08-21",
        "2017-08-22",
        "2017-08-23",
        "2017-08-24"
      ]
    },
    "porto-2": {
      "name": "Porto, Portugal",
      "posts": [
        "2017-08-25",
        "2017-08-26",
        "2017-08-27",
        "2017-08-28"
      ]
    },
    "milan": {
      "name": "Milan, Italy",
      "posts": [
        "2017-08-29"
      ]
    }
  },
  "posts": {
    "2017-05-09": {
      "locationId": "orlando",
      "text": "Welcome to my 2017 worldwide trip microblog! Here's the deal: every day, I'll use [Gyroscope](https://gyrosco.pe/) to generate a card detailing the prior day. The card will contain a picture, as well as my step count and heart rate graph. Alongside the card, I'll also write a short post, just like this. The only restriction being that it can be no longer than 100 words. 100 words, like some weird Twitter. I'll talk about everything from what I did to who I met to what I learned. But that's all for today, as I'm running out of words. See you tomorrow!"
    },
    "2017-05-10": {
      "locationId": "orlando",
      "text": "I left my job at Google about three and half weeks ago. I’ll have more to say about that later, but for now, let me break down what I’ve been up to since then. I spent two weeks in San Francisco moving all my possessions into a storage unit and saying goodbye to friends, coworkers, and family. I then flew to central Pennsylvania where I packed my bag, visited my grandma (mom’s mom) in Pittsburgh, and spent time with my parents. Now, I’m visiting my grandpa (dad’s dad) in sunny and humid Orlando, Florida, my last stop before heading overseas."
    },
    "2017-05-11": {
      "locationId": "orlando",
      "text": "My stay in Orlando was quiet, but in a good way. It was the first quality alone time I've spent with my grandpa. He's not much of a talker, and my grandma (who passed away at the end of 2014) dominated conversation when I saw them. I will cherish this visit, walking around the lake and sharing meals. He told me stories I had never heard, including getting drafted for the Korean War, meeting my grandma on a double blind date, and raising my dad in Philadelphia. He was a gracious host and I look forward to visiting again."
    },
    "2017-05-12": {
      "locationId": "gran-canaria",
      "text": "The international portion of the trip has finally begun! After a long 16 hour journey from Orlando to London to [Gran Canaria](https://en.wikipedia.org/wiki/Gran_Canaria), I'm finally in the Canary Islands! In case you’re not a geography expert, those would be [in the Atlantic Ocean, just off Africa's west coast](https://www.google.com/maps/place/Canary+Islands,+Spain/data=!4m2!3m1!1s0xc41aa86ef755363:0x10340f3be4bc8c0?sa=X&ved=0ahUKEwjwuYG03ffTAhWMOCYKHQ6IBr4Q8gEIiQEwDw). The view of the late afternoon sun illuminating the cloud-covered islands was breathtaking. It filled me with relief. I’ve been dreaming of and planning this trip for a long time. I’m glad it’s finally started, I’m excited to see where it takes me, and I hope you enjoy following along."
    },
    "2017-05-13": {
      "locationId": "gran-canaria",
      "text": "I'm already beginning to realize I underestimated a few things about solo travel. While the flexibility is great, small things become more difficult. I relaxed at the *playa* (\"beach\") today, where I usually spend most of my time in the water. But when you’re by yourself, there's no one to watch over your belongings when you want to swim. I tried asking someone nearby to be my eyes, but the language barrier made that difficult. As with anything in life, you spend all your time planning the big things, but it's often the little things that get in the way."
    },
    "2017-05-14": {
      "locationId": "gran-canaria",
      "text": "I took a day trip to [Tejeda](https://en.wikipedia.org/wiki/Tejeda), a small village located towards the center of Gran Canaria which is known for its delicious almonds. Getting there was an adventure, as I'm quickly learning bus schedules on the island are more suggestions than actual plans. I intended to hike [Roque Nublo](https://en.wikipedia.org/wiki/Roque_Nublo), but the bus there from Tejeda wasn't running. Instead, I climbed [Roque Bentayga](https://es.wikipedia.org/wiki/Roque_Bentayga), a religious site for the ancient Canarians which was formed as the volcanic island was going through its death throes. The views from up there were breathtaking, including this shot I got of Tejeda."
    },
    "2017-05-15": {
      "locationId": "gran-canaria",
      "text": "Another day, another invisible bus. I left Las Palmas early to head to [Casas Rurales de Guayadeque](http://casasruralesdeguayadeque.com/index_en.html), cave *casas* (\"houses\") carved out of volcanic rock. Unfortunately, the bus never showed up and I was left to hike the last six miles with all my gear. I regretted it about two miles in. But once I arrived, showered, and napped, I ate a fabulous meal in the cave restaurant nearby. The day didn't go as planned, which I'm sure will happen plenty more times on this trip. But that won’t stop me from enjoying myself and making the most of it."
    },
    "2017-05-16": {
      "locationId": "tenerife",
      "text": "After my walking adventure yesterday, I decided to schedule a taxi to take me the airport for a flight to my next destination in the Canary Islands chain, [Tenerife](https://en.wikipedia.org/wiki/Tenerife). I'm trying to test out various living situations, so after an Airbnb and hotel in Gran Canaria, I'm staying in a hostel in Tenerife. The hostel is called [Ratones de Biblioteca](http://www.bookwormhostel.com/en/) and has a charming book theme. Once I was all checked in, I went on a short hike and walked around the towns of La Laguna and Santa Cruz. It was a pretty low-key day in preparation tomorrow's volcano summit."
    },
    "2017-05-17": {
      "locationId": "tenerife",
      "text": "Time to cross \"hike up a volcano\" off my bucket list. At 3.7 km above sea level, [Pico del Teide](https://en.wikipedia.org/wiki/Teide) is Spain’s highest point. A grueling 3.5 hour hike of steep switchbacks akin to a non-stop StairMaster with majestic views took me to the peak, where I was joined by dozens who had similarly made the hike. I kid - most took the ten minute lift up the volcano. But I can guarantee none enjoyed that view as much as I did. The difficult journey amplified the ultimate reward, a lesson I’ll keep in mind over the coming months."
    },
    "2017-05-18": {
      "locationId": "tenerife",
      "text": "Scaling a volcano one day; caving underneath it the next. [*Cueva del Viento*](http://www.cuevadelviento.net/?lang=en) (\"Wind Cave\") is the largest lava tube in Europe and home to some evolutionary gems: eye-less cockroaches, insects with photo-sensitive skin, pigmentation-free critters. At one point in the tour, we turned off our headlamps and just sat in silence. It was blackness so dark you couldn’t tell whether or not your eyes were open! It’s ironic that despite the views of the fascinating lava tubes and the black sand beaches of [Puerto de la Cruz](https://en.wikipedia.org/wiki/Puerto_de_la_Cruz) I visited afterwards, the pure black nothingness was the most memorable."
    },
    "2017-05-19": {
      "locationId": "lanzarote",
      "text": "A 7 AM fight from Tenerife to [Lanzarote](https://en.wikipedia.org/wiki/Lanzarote) left me a lot of time to discover this smaller island. Due to minimal bus routes and my failure to properly book a guided tour, I rented a car and became my own tour guide. From the lunar landscapes of [Timanfaya National Park](http://www.cactlanzarote.com/en/cact/montanas-del-fuego-timanfaya/) to the merging of nature, architecture, and art at [Jameos del Agua](http://www.cactlanzarote.com/en/cact/jameos-del-agua/) and [Cueva de los Verdes](http://www.cactlanzarote.com/en/cact/cueva-de-los-verdes/) to the brutal beauty of the cacti in the [Jardin de Cactus](http://www.cactlanzarote.com/en/cact/jardin-de-cactus/) to the sweeping vistas of [Mirador del Rio](http://www.cactlanzarote.com/en/cact/mirador-del-rio/), Lanzarote is truly other-worldly!"
    },
    "2017-05-20": {
      "locationId": "lanzarote",
      "text": "If you ever need inspiration, make your way to an Ironman finish line and watch the sheer joy on the faces of the men and women running, walking, and fainting across it. That’s where I unexpectedly found myself after some scuba diving in [Puerto del Carmen](https://en.wikipedia.org/wiki/Puerto_del_Carmen). The [Ironman Lanzarote](http://eu.ironman.com/triathlon/events/emea/ironman/lanzarote.aspx#axzz4i0zKRgo3) is one of the hardest Ironmans in the world because, well, the course is a series of massive volcanoes. The vibe at the finish line was electric as hundreds - myself included - cheered finishers down the final stretch. My first birthday on my own was a memorable and inspiring one."
    },
    "2017-05-21": {
      "locationId": "gran-canaria-2",
      "text": "I took a late morning flight back to Gran Canaria, this time choosing to stay on the southern end of the island, in [Maspalomas](https://en.wikipedia.org/wiki/Maspalomas). The main draw was the [Maspalomas Dunes](https://en.wikipedia.org/wiki/Maspalomas_Dunes), yet another foreign landscape to explore on these volcanic islands. I allowed myself to get lost in the dunes and happened upon a community of men who - how do I put this? - were full body sunbathing. Not the sights I wanted! Other than the dunes, Maspalomas was a drab, touristy area. I wouldn't come here again, but at least I found some time to relax in the evening."
    },
    "2017-05-22": {
      "locationId": "porto",
      "text": "It’s a shame the Canary Islands aren’t as well known. I urge anyone who enjoys beautiful beaches or the mind-bending variety of nature to visit. I left today and headed to [Porto](https://en.wikipedia.org/wiki/Porto), a stunning city on the Portuguese coast and a longtime dream destination of mine. After checking into [Bluesock Hostel](https://www.bluesockhostels.com/), I walked the hilly cobblestone streets in search of [*francesinha*](https://en.wikipedia.org/wiki/Francesinha), a \"sandwich\" packed with a variety of meats, covered in gravy, and topped with an egg. I wish I could have eaten more, but it was just too filling! I guess I'll be ordering another one later this week."
    },
    "2017-05-23": {
      "locationId": "porto",
      "text": "I met a few people on a morning walking tour from [Porto Walkers](https://www.portowalkers.pt/), and we decided to follow it up with a wine tasting tour. The latter was a bit more exciting, maybe due to the seven glasses of Porto’s famous [port wine](https://en.wikipedia.org/wiki/Port_wine) we each had. After the tours, my group of new friends from all over the world shared a lively meal together. We kept the party going until the early morning by sharing some [Super Bock](https://en.wikipedia.org/wiki/Super_Bock) at the beer garden and dancing at the bars. Quite a long, but energy-filled first full day in Porto."
    },
    "2017-05-24": {
      "locationId": "porto",
      "text": "Arriving in Porto marks the beginning of the working portion of my trip. Despite people’s assumptions that this trip is purely a vacation, it's actually my time to finally work on my own things full-time. It's ironic that although software developers can work from anywhere with internet, most congregate in Silicon Valley. I realized I could redirect my rent money to experience the world. Although the vacation aspect is obviously there, I have goals for these months abroad that I’ll share this week. The first is a meta one: maintaining this microblog to share my trip with others."
    },
    "2017-05-25": {
      "locationId": "porto",
      "text": "My second goal is to walk at least 14,286 steps every day. Why such a seemingly random number? If I walk that amount every day, I'll hit 100,000 steps per week, a number that will keep me healthy and ensure I’m out enjoying the beautiful places I visit. Walking is the purest form of traveling. Things buzz by too quickly on a bus or car. When you walk though, you have the freedom to stray off course to find that hidden gem hiding just around the corner. And in places like Porto, there are plenty of them!"
    },
    "2017-05-26": {
      "locationId": "porto",
      "text": "As a compulsively active individual, I struggle to sit still as I feel guilty for not using time productively. But I've heard so much about the benefits of meditation that another goal of mine is to meditate daily (via an app called [Headspace](https://www.headspace.com/)). I’m reading [\"Mindfulness In Plain English\"](http://www.vipassana.com/meditation/mindfulness_in_plain_english.php) for some inspiration, and wow! A book’s opening chapter has never spoken to me more, taking about \"an inherent unsatisfactoriness in life which simply will not go away.\" I’ve felt that unsatisfactoriness recently and I'm ready to take it on head first. Meditation is one tool I'm utilizing in that fight."
    },
    "2017-05-27": {
      "locationId": "porto",
      "text": "Okay, quick detour to talk about something that happened this afternoon after climbing to the [highest point I could find](https://pt.wikipedia.org/wiki/Mosteiro_da_Serra_do_Pilar). While reading alone, a local teenager dressed like a girl scout came up to me, asking \"Have my heart?\" I was caught off guard until I noticed on origami heart in her outstretched hand with *\"Somos um\"* (\"We are one\") scrawled on it. It was a touching moment, standing in stark contrast to the growing xenophobia back home. We are one, indeed. We may look and speak differently, but we all have the same rights to love and be loved."
    },
    "2017-05-28": {
      "locationId": "porto",
      "text": "My next goal is to meet someone new every day. Make a real, human connection. Find out what excites them, what worries them. Today it was a lovely girl named Germana from Naples. I rescued her phone with my portable charger, which led to hours of wonderful company over dinner and port wine. Meeting people while traveling is hard because relationships are short-lived. But that allows you to skip boilerplate conversation and instead jump straight into topics you are mutually passionate about. People like Germana will make my trip memorable, and I'm eager to meet more like her."
    },
    "2017-05-29": {
      "locationId": "lisbon",
      "text": "After a charming week in Porto, it was time to move on. I took a 3.5 hour train ride south along the Portuguese coast to [Lisbon](https://en.wikipedia.org/wiki/Lisbon). I checked into the [Lookout! Lisbon Hostel](http://lookoutlisbonhostel.com/) and went off for some sightseeing. Over dinner in one of Lisbon's countless alleyway restaurants, I accomplished another daily goal: write down five project and/or startup ideas every day. This trip is about figuring out what I want to pursue next, so consistently pondering new ideas is essential. I choose a daily theme to act as a prompt for my brainstorming. Today’s theme, naturally, was food."
    },
    "2017-05-30": {
      "locationId": "lisbon",
      "text": "I spent much of today walking around Lisbon, known as the \"European San Francisco\" by many. The name is fitting. Their main bridge is an [amalgamation of San Francisco's two major bridges](https://en.wikipedia.org/wiki/25_de_Abril_Bridge#Design). Their most symbolic mode of transportation is a trolley. The place is hilly as hell. And the vibe of the city reminds me of home, which feels nice at this point in the trip. But exploring makes it hard to accomplish my last goal: release something every week. This goal will be my hardest and it'll take time to figure out how to work while on the road."
    },
    "2017-05-31": {
      "locationId": "lisbon",
      "text": "Lisbon is not lacking in things to do. Today it was a guided tour in an old VW van up the bumpy, misty mountains roads of [Sintra](https://en.wikipedia.org/wiki/Sintra). We covered a lot of ground, highlights including [continental Europe's westernmost point](https://en.wikipedia.org/wiki/Cabo_da_Roca) and a [Masonic well inspired by Dante's Inferno](https://en.wikipedia.org/wiki/Quinta_da_Regaleira#Initiation_Wells). Each day brings another alluring trip, another roommate urging you to go out, another incredible landmark. Distractions make it difficult to get serious work done, and the willpower to pass up on them is the first of the struggles of solo travel I’ll discuss as the theme for this week."
    },
    "2017-06-01": {
      "locationId": "lisbon",
      "text": "Finally a productive work day. First order of business is updating [my personal website](https://jwn.gr/). The previous version was made with Squarespace, but I'm rebuilding it from scratch and simplifying things considerably. [Cafe Tati](https://get10things.com/lisbon/breakfast-lisbon/cafe-tati/) was today's office. Though the food and ambiance were great, Wi-Fi was spotty. It’s hard enough to find places with Wi-Fi, let alone ones with strong signals. Hostels typically have solid Wi-Fi, but they’re loud and distracting (see yesterday’s post). I’ve resorted to asking locals where they work from and just making sure I can do constructive work while offline, since this will be a common problem."
    },
    "2017-06-02": {
      "locationId": "lisbon",
      "text": "Before I left for another work day, I grabbed \"breakfast\" at [Pop Cereal Cafe](http://www.popcereal.com/). They serve cereal medleys mixed with sweets like M&M's and ice cream. I went for the [\"Before and After Eight.\"](https://www.zomato.com/grande-lisboa/pop-cereal-café-bairro-alto-lisboa/menu) For what it lacked in healthiness, it made up for in deliciousness. It illustrates the difficulty of eating balanced meals on the road. It's difficult to eat well when Portugal's idea of a serving of vegetables is french fries. I grab fruit from the market and swap out french fries for a salad when I can, but finding wholesome meals is still a work in progress."
    },
    "2017-06-03": {
      "locationId": "lagos",
      "text": "I made a last minute decision to stay in Portugal and head down south to [Lagos](https://en.wikipedia.org/wiki/Lagos,_Portugal). It was recommended by both locals and fellow travelers enough times that I had to check it out. Now that I've walked along the scenic beaches, I understand why. It did mean packing up and saying goodbyes though. Restarting every week is somewhat exhausting. I've made friends, but not without effort. I can tell some of my walls are falling down and I’m more open to meeting people - which was something I had hoped for - but I’ve still got a long way to go."
    },
    "2017-06-04": {
      "locationId": "lagos",
      "text": "I smell kinda gross. Not normally, but solo traveler me has a stench. I've long since used up my deodorant and it’s been replaced with this odd, less effective antiperspirant spray. I shower daily, but hostel rooms undo that fairly quickly. I do laundry weekly, but the clean clothes go directly into my bag which has already been through a lot. Every restaurant seems to be covered in a cloud of cigarette smoke which finds sanctuary in the threads of my clothes. I've resigned myself to the fact that I won’t truly feel clean while living the hostel life."
    },
    "2017-06-05": {
      "locationId": "lagos",
      "text": "Spontaneity doesn't come naturally to me. Predictability reduces my stress and ensures my productivity. But it also means I forgo things that don’t fit the schedule. This has caused friction in prior relationships and I’m striving to find a happier balance. I'm now in a situation where I rarely know where I'll be sleeping in three days. It’s stressful, but a lot is self-induced by always expecting the worst case scenario, which rarely occurs. Instead, I'm trying to trade money and time for flexibility and letting life unfold on its own. Today, that led me kayaking into some unbelievable caves."
    },
    "2017-06-06": {
      "locationId": "lagos",
      "text": "My biggest fear for this trip was loneliness. Some days I simply want to share with someone special, not just a new acquaintance. Today was one of those days. I took a trip to hike along the prodigious cliffs of [Sagres](https://en.wikipedia.org/wiki/Sagres_(Vila_do_Bispo)). Being left alone with my thoughts was tiresome, and this week's events - including the [day I cracked both of my phone's screens](https://twitter.com/_jwngr/status/871486110530142212) - finally caught up with me. Loneliness comes and goes, but it's not a foreign feeling. It's one I've felt back home surrounded by roommates, family, and friends. I'm hoping this trip can help me better understand it."
    },
    "2017-06-07": {
      "locationId": "lagos",
      "text": "Completing one project inspires me to dive into the next, which happens to be a website for this very microblog. The weekly newsletter will continue, but I want to more easily showcase and share posts. After an extended workday, I watched the sunset over the cliffs at [Ponta da Piedade](https://en.wikipedia.org/wiki/Ponta_da_Piedade). What about sunsets garners such awe? The beautiful colors? The visible transition from day to night, which stands in stark contrast to the gradual changes throughout the day? The ability to see the movement of a glowing orb millions of miles away? For me, it’s all of the above."
    },
    "2017-06-08": {
      "locationId": "seville",
      "text": "At the end of this month, I’m flying from Paris to Chennai to spend some time in southern India. So although I’ve enjoyed Portugal, I need to start heading east. I saw much of Spain when I did a summer study abroad there, but one city I never made it to was [Seville](https://en.wikipedia.org/wiki/Seville), so that’s where I find myself. The heat here is oppressive, regularly peaking into the triple digits. It’s been a while since I’ve experienced this kind of heat, but I guess it’s good preparation for the upcoming India leg of my trip."
    },
    "2017-06-09": {
      "locationId": "seville",
      "text": "My first full day in Seville was a typical new work day for me. Wake up, shower, grab a sandwich from a bakery, hide away in a coffee shop. Without considering it was hot as hell, I ordered my standard hot chocolate and was greeted with a stunned reaction. After some laughing at my expense, the barista helped me settle on a refreshing banana chocolate smoothie. In addition to some website development, I solidified travel plans up through July. Not having to worry about lodging and travel for a few weeks has freed me up to focus elsewhere."
    },
    "2017-06-10": {
      "locationId": "seville",
      "text": "I spoke with an Australian couple about the concept of [\"luck surface area\"](http://www.codusoperandi.com/posts/increasing-your-luck-surface-area) at a paella cooking class this evening. The idea is that while success is often attributable to luck, you can improve your chances of it happening to you by taking risks and sharing your ideas broadly. You never know when you’ll meet your best friend, business partner, or spouse. Being at the right place and time isn't enough. You must put yourself out there to make things happen. Increasing your luck surface area means opening yourself up for luck to strike and snatching it when it does."
    },
    "2017-06-11": {
      "locationId": "seville",
      "text": "I've started experimenting with how long I can last before asking someone where they're from or what they do. Rehashing the same conversation with new faces every day gets exhausting. Thankfully, today I endured the sweltering heat alongside two girls from my hostel, one Brazilian and the other German. After a subpar free walking tour - you generally get what you pay for - we shared some sangria and visited [Seville's bullring](https://en.wikipedia.org/wiki/Maestranza_(Sevilla)), enjoying wide-ranging conversations throughout. Avoiding boilerplate smalltalk is good for my sanity while traveling, but I also think it's a useful exercise I'll bring back home."
    },
    "2017-06-12": {
      "locationId": "seville",
      "text": "The heat here makes it difficult to stay outside for extended periods, meaning more time inside coding. I'm also naturally inclined to work after extended time off. I discussed this over tapas with another hostel-mate, Sarah. We share the mentality that while vacations are great, there's only so much sitting around we can do before we feel the urge to create. I've reached that point. I don’t plan to stop traveling, but I’m fine spending a day inside hacking as long as I get a little outside time, which I did today in the botanical gardens of [Reales Alcázar](https://en.wikipedia.org/wiki/Alcázar_of_Seville)."
    },
    "2017-06-13": {
      "locationId": "seville",
      "text": "This microblog now has [a dedicated website](https://jwn.gr/microblog/)! Pages take a while to load, the desktop layout looks better than the mobile one, and I’m not quite happy with the color scheme. But it existing is better than the alternative. In software development, this is known as releasing a [minimum viable product (MVP)](https://en.wikipedia.org/wiki/Minimum_viable_product). Some startups burn years and millions of dollars toiling away on products that no one wants or are impossible to use. Instead, you should release early, gather feedback, and iterate. It’s hard to release something that isn’t perfect, but you probably waited too long if it is."
    },
    "2017-06-14": {
      "locationId": "seville",
      "text": "At a rate of around 1,000 steps every ten minutes, it takes about 2.5 hours of walking to reach [my daily step goal of 14,286](https://jwn.gr/microblog/2017-05-25). I make as much out of that time as I can. As I explore sights like today's stop, the [Seville Cathedral](https://en.wikipedia.org/wiki/Seville_Cathedral), I listen to podcasts, possibly my favorite - and arguably the most underrated - entertainment medium. I use [Overcast](https://itunes.apple.com/us/app/overcast-podcast-player/id888422857?mt=8) to listen to podcasts ranging from tech to science to psychology to Notre Dame to murder mysteries. The podcasting landscape is vast and varied. I’ll be sharing my all-time favorite podcasts and episodes throughout this week."
    },
    "2017-06-15": {
      "locationId": "marseille",
      "text": "Time to ditch the heat and head to [Marseille, France](https://en.wikipedia.org/wiki/Marseille). I spent my first day here as I usually do, walking aimlessly, notching another of my increasingly frequent 30k+ step days. Along the way, I listened to [\"Reality Part Two\"](http://www.npr.org/2017/06/08/531905309/reality-part-two) from [Invisibilia](http://www.npr.org/podcasts/510307/invisibilia), a show scrutinizing human behavior. They interviewed a former Googler who yearned to break free from his bubble. Hmm, sounds familiar… Instead of a worldwide trip, he created a series of apps to randomize his life. Through attending strangers' Facebook events and vacationing in unexpected places, he realized people have a lot more in common than he thought."
    },
    "2017-06-16": {
      "locationId": "marseille",
      "text": "Marseille's main attraction is the glimmering basilica of [Notre Dame de la Garde](https://en.wikipedia.org/wiki/Notre-Dame_de_la_Garde) atop its highest hill. As I made the climb, I listened to the latest episode of [Radiolab](http://www.radiolab.org/), which told [the unexpected story of Venice's first female gondolier](http://www.radiolab.org/story/gondo/). Radiolab is a veteran in the podcasting space with an impressive archive of episodes which weave together science, stories, and sound. My favorite must-listen-to episodes include [\"60 Words\"](http://www.radiolab.org/story/60-words/), [\"Sight Unseen\"](http://www.radiolab.org/story/sight-unseen/), [\"Colors\"](http://www.radiolab.org/story/211119-colors/), and [\"Lost & Found.\"](http://www.radiolab.org/story/110079-lost-found/) Their live performances, although rare, are incredible to see in person and are can't-miss experiences if they stop by your city."
    },
    "2017-06-17": {
      "locationId": "marseille",
      "text": "I’m in the midst of my next project, a rehash of something from college. I’ve spent the past two days trying to get my old code working and cleaned up. Programming is often hit or miss. It's not unusual to spend an entire day unsuccessfully completing a single task, only to crank it out in just fifteen minutes the next day. Hopefully that'll be the case here. I did successfully listen to an episode of [99% Invisible](http://99percentinvisible.org/) though, a delightful podcast about the design hidden in everyday life. Great episodes to start with are [\"Ten Thousand Years\"](http://99percentinvisible.org/episode/ten-thousand-years/) and [\"Vexillonaire.\"](http://99percentinvisible.org/episode/vexillonaire/)"
    },
    "2017-06-18": {
      "locationId": "nice",
      "text": "I’m glad I only chose to stay in Marseille a few days. The city felt sparse and unwelcoming. I've moved up the coast to [Nice](https://en.wikipedia.org/wiki/Nice), which has water as blue as opal and that enchanting European small-town vibe. As I explored, I caught up on [CodePen Radio](https://blog.codepen.io/radio/), a show hosted by the co-founders of [CodePen](https://codepen.io/), an interactive web development playground. In addition to building a useful product, I learn a lot from their podcast, which focuses on running online businesses. I’ve been listening for years, as I’ve found them an invaluable resource on everything from managing servers to managing people."
    },
    "2017-06-19": {
      "locationId": "nice",
      "text": "An hour east of Nice along the [Côte d’Azur](https://en.wikipedia.org/wiki/French_Riviera) is [Monaco](https://en.wikipedia.org/wiki/Monaco), a country so small I walked its length in an hour. Along the way, I stopped at [Villefranche-sur-Mer](https://en.wikipedia.org/wiki/Villefranche-sur-Mer) and [Èze](https://en.wikipedia.org/wiki/%C3%88ze), the latter’s winding cobblestone streets being today's top highlight. While I wasn't being rejected entry into the Monte Carlo Casino due to dress code, I listened to [Reply All](https://gimletmedia.com/reply-all/), a podcast which, at its core, is about Internet culture. My favorite episodes are those where they play [\"Yes, Yes, No\"](http://yesyesnos.tumblr.com/) and those where they go into detective mode to uncover some [unexpected secrets](https://gimletmedia.com/episode/99-black-hole-new-jersey/) during their \"Super Tech Support\" segment."
    },
    "2017-06-20": {
      "locationId": "nice",
      "text": "An hour train ride the opposite direction from Monaco is [Cannes](https://en.wikipedia.org/wiki/Cannes), internationally known for its ritzy annual film festival. The town was bustling with a major #branding conference sporting all types of tech companies, highlighted by a [Snapchat ferris wheel](http://blog.hollywoodbranded.com/june-3-snapchats-brand-marketing-wins-big-at-cannes). Before heading back to Nice, I stopped by [Antibes](https://en.wikipedia.org/wiki/Antibes) to see some super yachts up close and personal. Today’s podcast was [Song Exploder](http://songexploder.net/), the only podcast I don't listen to on double speed. The host interviews musicians and composers, breaking down their music into its composite parts. A unique podcast to round out this week's list."
    },
    "2017-06-21": {
      "locationId": "lux",
      "text": "I always pause before I send out my weekly newsletter. I imagine what my parents will think. I wonder if my college friends will judge me. Hell, I even wonder if my ex-girlfriends will read it. Not caring what other people think is incredibly difficult. Am I holding back because I know others are following along? I often think about Lena Dunham's parents. Do they watch \"Girls\"? What are they thinking when she's spewing vulgarities or completely naked? I envy her ability to do creative work with no restraint. How do I allow myself to create without restrictions?"
    },
    "2017-06-22": {
      "locationId": "lux",
      "text": "This trip constitutes the longest I've been apart from anyone I know. Well, it did, until I saw Caroline, one of my first college friends. My visit to [Luxembourg](https://en.wikipedia.org/wiki/Luxembourg_City), her residence for the past two years, coincides with [*Nationalfeiertag*](https://en.wikipedia.org/wiki/Grand_Duke's_Official_Birthday). Caroline always has a smile on her face and usually puts one on mine. She and her fiancée guided me around Luxembourg, the kind of place found on jigsaw puzzles at antique stores. I'm glad she lives here; I wouldn't have thought to come otherwise. And it's not just the views. As I found out, the Luxembourgish throw a great party!"
    },
    "2017-06-23": {
      "locationId": "lux",
      "text": "*&ast;buzzz&ast; &ast;buzzz&ast; &ast;buzzz&ast;* What the fuck? It's so bright. What time is it? I need to turn this alarm off before I annoy my roommates. When did I even get back last night? My sense of time is always the first thing to go. Around 3 AM? I dunno, the details are fuzzy. Fireworks. Rum out of a champagne glass. Oh, that girl! I wish I had gotten her number. Not that I’ll ever see her again... Oh well, I guess. Ah, here’s my phone. 9:43. Shit! I gotta check out of here soon. *&ast;loud exhale&ast;* Time for another day."
    },
    "2017-06-24": {
      "locationId": "paris",
      "text": "I’m finding time to read in the midst of work and travel. I just finished [\"Creative Genius\"](https://smile.amazon.com/Creative-Genius-Simple-Passion-Motivated-ebook/dp/B0163BAUWC) today, a short book about motivation, pursuing your passion, and doing creative work. It contains plenty of morsels of inspiration, but my favorite was \"Great work doesn't happen every day, you work every day to make it happen.\" How true that is! Masterpieces aren't made in a day, but they aren't made without daily effort either. There's nothing like walking (a lot!) around Paris and gazing upon the Eiffel Tower, Notre Dame, and the Arc de Triomphe to drive that point home."
    },
    "2017-06-25": {
      "locationId": "paris",
      "text": "Of all the cities I've visited so far, Paris has yielded the most varied opinions. Some say it's a magical place, their favorite city in the world. Others wrinkle their face, claiming it's nothing special. I'm starting to understand why. To a certain extent, my opinions about where I've been are less about what they offer and more about who I've met and how I've felt there. Looking back on Marseille, one chance encounter or one bit of good news could've changed my experience entirely, despite the city remaining unchanged. I'm becoming more aware how my attitude colors my experiences."
    },
    "2017-06-26": {
      "locationId": "paris",
      "text": "A trip to Paris is incomplete without visiting some art museums. Today it was [Musée de l'Orangerie](https://en.wikipedia.org/wiki/Mus%C3%A9e_de_l'Orangerie) and the world-renowned [Louvre](https://en.wikipedia.org/wiki/Louvre). While it's surreal to observe pieces like Monet's [*Water Lilies*](https://en.wikipedia.org/wiki/Mus%C3%A9e_de_l'Orangerie#Monet.27s_Water_Lilies), da Vinci's [*Mona Lisa*](https://en.wikipedia.org/wiki/Mona_Lisa), and [*Venus de Milo*](https://en.wikipedia.org/wiki/Venus_de_Milo) in person, I most enjoy art that is either technically impressive or a creative application of the medium. And when it's both, like Panini's duo of paintings [*Ancient Rome*](https://en.wikipedia.org/wiki/File:Giovanni_Paolo_Panini_%E2%80%93_Ancient_Rome.jpg) and [*Modern Rome*](https://en.wikipedia.org/wiki/File:Giovanni_Paolo_Panini_%E2%80%93_Modern_Rome.jpg), I'm absolutely mesmerized. I was immediately drawn to the concept of an art gallery within a painting, and the execution - down to the smallest details - is remarkable."
    },
    "2017-06-27": {
      "locationId": "paris",
      "text": "I leave for India in two days. I'd be lying if I said I wasn't nervous. I still remember the shellshocked feeling from my trip there a decade ago. This won't be a vacation by any means. Hopefully it will be fruitful for me and those I'm teaching. But I'm apprehensive. I feel unprepared for the lessons I'll be teaching. I expect to struggle with the taste of the food. And the heat, oh the heat! But most of all, I'm uneasy about being responsible for things other than myself again. It's going to be quite the change of pace."
    },
    "2017-06-28": {
      "locationId": "paris",
      "text": "For my last full day in Paris, I took a train to [Versailles](https://en.wikipedia.org/wiki/Palace_of_Versailles), a royal chateau southwest of the city dating to the 11th century. It was over the top gorgeous, a grandiose display of wealth consisting of meticulously-crafted marble sculptures, swimming pool-sized paintings, and an unreal quantity of gold. Although I enjoyed ogling everything inside the chateau, I spent most of my time walking around (and getting lost in) the extensive gardens. I made quick friends with some curious goats and meditated in my most tranquil spot yet. A satisfying day to cap this leg of the trip."
    },
    "2017-06-29": {
      "locationId": "mumbai",
      "text": "My step count suffered from a long flight on a day cut short by timezones. But that gives me time to explain why I'm en route to India. [Communities Rising](http://www.communities-rising.org/) (CR) is a non-profit working to teach [*Dalit*](https://en.wikipedia.org/wiki/Dalit) children English, [Tamil](https://en.wikipedia.org/wiki/Tamil_language), math, and computers in [Tamil Nadu](https://en.wikipedia.org/wiki/Tamil_Nadu), a state in southern India. It grew out of a separate organization I visited with a decade ago, and I've been involved with Communities Rising ever since, now sitting on its Board of Directors. It took me longer than expected to come back, but 15 hours of travel later, I have finally returned."
    },
    "2017-06-30": {
      "locationId": "mundiyambakkam",
      "text": "Limiting myself to 100 words per day while in India will be a tall task. Betsy McCoy, founder of Communities Rising and director of day-to-day operations, has ensured I'll be plenty busy. I'll primarily be teaching a computer programming course, but I’ll also be assisting at Communities Rising's after school centers. Adding in a trip to Bangalore to visit a partner organization and a weekend teaching retreat, I'll have plenty to do and write about. But today was my day off, filled with recovering from jet lag, preparations for class, and meeting my new roommates, who you'll hear about tomorrow."
    },
    "2017-07-01": {
      "locationId": "mundiyambakkam",
      "text": "The top two floors of a three story house in [Mundiyambakkam](https://www.google.co.in/maps/place/Mundiyampakkam,+Tamil+Nadu+605601/@7.5501707,72.4214332,4.81z/data=!4m5!3m4!1s0x3a5350fd2ac9dc37:0xe110f2d8f8e0fc30!8m2!3d11.9975683!4d79.5158364?hl=en) is Betsy's residence six months each year. It's shared with a cast of 20-something Indian men who are CR teachers and staff, plus some younger kids Betsy has all but officially adopted. She's affectionately called \"Mom\" by all. Spiders and roaches are common, an unsurprising fact given nonexistent trash collection. But with my own bedroom, AC, and serviceable WiFi, it's in some ways an improvement over hostels, and far better than neighbors. Tonight, it accommodated a 50th birthday celebration for Father Felix, a friend and important part of CR."
    },
    "2017-07-02": {
      "locationId": "mundiyambakkam",
      "text": "I stayed at St. Patrick's Home on my last trip, where a group of exuberant 5th standard kids were taking a \"gap year\" to improve their English, Tamil, and math. Luck has it today was their ten year reunion. We were greeted not by kids, but by 20-year-old adults, one year from college degrees in commerce, computers science, and fashion design. Escaping the poverty surrounding them is still far from a foregone conclusion. But seeing their transformations through my watery eyes and hearing their emotional speeches was a great reminder of why I find myself halfway around the world."
    },
    "2017-07-03": {
      "locationId": "mundiyambakkam",
      "text": "Day one of my programming course is in the books! Almost everyone was an hour late to the two hour class, a typical occurrence in these parts given unreliable transit and a general lack of urgency. I'm discovering the intractable problems Betsy faces daily. Meetings always start late. Events are cancelled after you've already arrived. Pertinent information isn't disclosed unless explicitly requested. Things are generally inefficient. Although that make completing tasks difficult, inefficiencies provide opportunities. CR is working to exploit these inefficiencies when it comes to education. The consistently rising test results from our centers is evidence that it's working."
    },
    "2017-07-04": {
      "locationId": "mundiyambakkam",
      "text": "The only hot dogs consumed during this Independence Day abroad were on a YouTube video of Nathan's Hot Dog Eating Contest I showed the guys at the house. It stood in stark contrast to my afternoon visit to CR's after school center in Sithani, where goats, chickens, and cows interspersed themselves with 70 energetic kids from 2nd to 8th standard. I joined them in meditating, spelling words with [Bananagrams](http://www.bananagrams.com/games/bananagrams) tiles, and reading Tamil and English books aloud. It's impossible not to smile when surrounded by a throng of elated kids shaking your hand and asking you your name in unison."
    },
    "2017-07-05": {
      "locationId": "mundiyambakkam",
      "text": "I scarfed down lunch after this morning's programming class before trekking to a local engineering college to talk in front of around 200 students. On minimal planning and wearing pants with a broken zipper (not enough words to explain...), I touched on various topics: my background, attending US universities, working at startups versus big tech companies, applying to tech jobs, growing tech trends, and a crash course in Python. Three hours of ad-libbing later, I headed back to the house for a quick dinner and a late night of editing this past week's microblog newsletter. An exhaustingly busy day!"
    },
    "2017-07-06": {
      "locationId": "mundiyambakkam",
      "text": "Life caught up with me today. A lack of sleep left me groggy for today's lesson, which dove into some tougher programming concepts. Some students are falling behind as language barriers abound with the technical jargon. On a personal note, some emotional baggage returned. I've been so busy since arriving in India that I unconsciously ignored the things I've been struggling with on this worldwide trip. A cocktail of tiredness and existential dread led to me crashing for a rare mid-day nap. Thankfully, nothing else was on this afternoon's schedule other than some badminton and helping prepare for tomorrow's retreat."
    },
    "2017-07-07": {
      "locationId": "mundiyambakkam",
      "text": "We are trying to scale the impact of CR. Educational and psychological results from our centers are positive, but opening new centers is time and money intensive. A more scalable solution which addresses the root issues with education in India is teaching our curriculum to instructors at existing schools. Betsy lined up five schools in our district to pilot our English program in a formal school setting this upcoming school year. Today, we kicked off a two day retreat in Pondicherry to train 35 English teachers from those schools. It was my first first phonetics lesson in quite a few years."
    },
    "2017-07-08": {
      "locationId": "mundiyambakkam",
      "text": "The teachers at this retreat are eager to learn the CR curriculum. My conversations with them highlight how rare an opportunity this is for them. Their schools receive next to no funding, struggling to acquire not just writing materials and books, but even electricity and proper bathroom facilities. They see this teacher training as a gift. Knowing it comes with whiteboards, children's books, and a variety of other learning materials provided by CR has them visibly excited. These five schools are hopefully just the beginning for us. We plan to take our curriculum far and wide over the coming years."
    },
    "2017-07-09": {
      "locationId": "mundiyambakkam",
      "text": "Sundays are for cricket. I also spent this one reflecting on privilege, a topic weighing heavily on me recently. I'm extremely privileged. American, white, male, physically able, well off family, married parents. At my brother's Stanford graduation, Cory Booker [recounted his dad's wisdom](https://www.youtube.com/watch?v=dZ39FswOyFk): \"Don’t act like you hit a home run when you were born on third base.\" My younger self was shell shocked in India ten years ago. I now better understand I was born with resources unimaginable to others. Realizing this has made me more empathetic, encouraging me to use my privilege to benefit more than just myself."
    },
    "2017-07-10": {
      "locationId": "bangalore",
      "text": "It’s a seven hour drive to [Bangalore](https://en.wikipedia.org/wiki/Bangalore), where we have some meetings scheduled for tomorrow. Speaking of driving in India... it's insane. Speed limits don’t exist. The few visible lane markers are ignored. A phone is never far from a driver's ear. Potholes, speed bumps, and cows are plentiful. Cars driving the opposite direction on the highway surround you on *both* sides. Oh, and cars honk their horns *constantly*. Hectic is putting it lightly, but drivers seem to revel in the challenge. Regardless, my heart rate always drops when the trip is over, especially after a long journey like today."
    },
    "2017-07-11": {
      "locationId": "bangalore",
      "text": "Organizations like CR without deep reserves work hard to simply fund existing projects. Grants are often earmarked for new initiatives, so finding larger donors to cover operating expenses is needed in order to focus on our work instead of our bank account. Today was a positive step in that direction. A large financial commitment from a Bangalore family will cover several of our centers for the next two years. A meeting with our existing partner, [Pratham Books](http://prathambooks.org/), didn't result in anything new just yet, but did foster that relationship and yield some promising referrals. A successful trip by any measure!"
    },
    "2017-07-12": {
      "locationId": "mundiyambakkam-2",
      "text": "Given the long break since last Thursday, I spent most of today's class reviewing programming fundamentals. I visited CR's Sithanangur center in the afternoon, where I was greeted by dozens of spirited children outside a dilapidated government school building. It's heartbreaking knowing their odds of getting a job which pays more than a few dollars a day is next to none. But for a couple hours a day, they can forget about their troubles and learn with each other. I need to remind myself that escaping poverty is often multi-generational, and CR helps lay the foundation to kickstart that process."
    },
    "2017-07-13": {
      "locationId": "mundiyambakkam-2",
      "text": "I awoke today with the right half of my bottom lip swollen to four times its normal size. Bug bites have been a constant nightly annoyance, forming mountain ranges of hives along my back, arms, and legs. I’ve typically done my best to ignore them, but today required some Benadryl. It worked like a charm, but getting through class hopped up on drowsy medication wasn't ideal. I slept in transit between afternoon visits to two more CR centers to deliver supplies and meet the teachers and kids. Everyday in India seem to bring its own unique challenge."
    },
    "2017-07-14": {
      "locationId": "mundiyambakkam-2",
      "text": "Today concluded my programming course. Despite my best efforts and muffled frustrations, some students still struggle to open files from the command line. Others though can solve non-trivial problems using loops, conditional statements, and functions. I had no idealistic expectations that I would somehow pump out star programmers over a two week period. But I did want to impart my passion for programming on them so they desire to continue learning even after I leave. For those that showed promise, I hope they make use of the resources available to them via the Internet-enabled CR computer centers."
    },
    "2017-07-15": {
      "locationId": "mundiyambakkam-2",
      "text": "This morning it was my right eye’s turn to swell up. I'm hopeful a move to a different, cleaner part of the house will make my last few nights here less itchy. After another dose of Benadryl, we inspected some land for a prospective CR headquarters. We plan to build an office and living quarters alongside a teacher training center. As I previously mentioned, focusing on training teachers will help us scale our impact and create a revenue stream. We're in the process of estimating costs and figuring out exactly what it'll take to make this vision a reality."
    },
    "2017-07-16": {
      "locationId": "mundiyambakkam-2",
      "text": "Another Sunday, another round of cricket matches. Today was also Betsy’s birthday. Birthdays are a huge deal around here, involving many visitors, wedding-style cake feedings, and copious amounts of chicken biryani. My worries about not liking Indian food clearly underestimated my younger self's pickiness. I’ve really enjoyed dining on a range of dosas, chutneys, curries, masalas, and, of course, biryanis. My main aversion comes from the heavy use of onions in some meals. And with how spicy everything is, often resulting in sweat beading on my forehead and chuckles erupting from those sitting around the table with me."
    },
    "2017-07-17": {
      "locationId": "mundiyambakkam-2",
      "text": "My last full day in India kicked off CR's new English literacy program for the five schools we trained earlier. Today's visit was to Adhanur, the smallest of the bunch at only 38 students across 1st to 5th standards. To get baseline scores for students' English abilities, we administered a simple test used elsewhere across India. It showed only a single student comprehended English sentences and a surprising amount couldn't even name letters. Our after-school centers perform much more favorably, giving us hope we'll see improved results when we test these students again upon the conclusion of the school year."
    },
    "2017-07-18": {
      "locationId": "new-york-city",
      "text": "This will surely turn out to the be the longest day of my worldwide trip. I flew across 13.5k miles of timezones to New York City, turning a standard 24 hour day into a 33.5 hour one. Although a somewhat inconvenient stopover on this worldwide trip, I'm back stateside for a college friend's wedding. A separate friend, Anand (founder of [Gyroscope](https://gyrosco.pe/), used to create this microblog's daily images), was my NYC tour guide. A run through Central Park. Artisanal cookies. Carnegie Hall. Radio City. Times Square. And to top off my travels, a two hour bus to New Haven, CT."
    },
    "2017-07-19": {
      "locationId": "new-haven",
      "text": "Despite being five years out from college, there's something about being back on a university campus that puts me in a good mood. My former college roommate at Notre Dame, Brian, showed me around Yale, where he is getting his PhD. I got a much needed haircut at the barber shop, worked out of the underground library, shot hoops in the student gym, and chatted over drinks at the grad student pub on \"2 for 1 Wednesday.\" Brian is one of those rare friends I pick up with right where we left off, as if no time has passed."
    },
    "2017-07-20": {
      "locationId": "boston",
      "text": "Brian and I took an early morning drive east to Boston, MA, where we connected with a few more Notre Dame friends for a Red Sox game, my first at Fenway Park. An early afternoon baseball game on a cloudless summer day is hard to beat. The sun shining down, the crack of the bat, a cold beer in my hand, peanut shells scattered at my feet. Quintessential summer. Finally crossing Fenway off my stadium list feels like a right of passage as a baseball fan. Watching the ballgame with my college buddies was just the cherry on top."
    },
    "2017-07-21": {
      "locationId": "west-bridgewater",
      "text": "A 45 minute drive south of Boston is West Bridgewater, MA, where I reunited with the rest of the dozen or so Notre Dame friends, as well as my parents, attending tomorrow's wedding party. My travels and my beard were hot topics. I found it strangely difficult to express exactly how my trip is going beyond the stock mentions of delicious food and incredible sights. I'm often frustrated by the loss in fidelity of thoughts going from my brain to my mouth and fingers. I've had so many thoughts swirling around lately, yet I can't suitably articulate them to others. "
    },
    "2017-07-22": {
      "locationId": "west-bridgewater",
      "text": "Today was filled with eating, drinking, swimming, and chumming it up at the wedding party. It's a peculiar feeling to see my friends getting married. It makes me reflect on my own past romantic relationships, many of which ended abruptly given my fear of longterm commitment and desire for a momentous life change. This worldwide trip itself played a part in the end of my most recent serious relationship. I'm more confident than ever that I want to share the ups and downs of life with someone, but I'm still looking for someone willing to shake everything up with me."
    },
    "2017-07-23": {
      "locationId": "mechanicsburg",
      "text": "I recently came across [a series of charts](https://www.theatlas.com/charts/HJFYm4uQ-) showing the average number of hours per day Americans spend with different groups of people (parents, friends, alone, etc.) over the course of their lives. The charts are a somewhat sobering look at what my future likely holds. And having spent much of the past three months apart from anyone I knew, I savored this weekend's celebrations with old friends and today's eight hour drive back to central Pennsylvania with my parents. I need to make the most out of this increasingly rare time back in my childhood home."
    },
    "2017-07-24": {
      "locationId": "mechanicsburg",
      "text": "Now that I'm back in the States, it's time to address everything which piled up while abroad, especially during my time in India. I follow the philosophy that if a task takes five minutes or less, I should do it immediately. Life is full of five minute tasks that people often postpone for later: triaging emails, cleaning dishes, paying bills, responding to Tinder matches, etc. The longer you shelve them, the more stressed out and less productive you become. Clearing out that backlog allows you to focus on larger, more significant tasks. Today involved completing those bite-sized tasks."
    },
    "2017-07-25": {
      "locationId": "mechanicsburg",
      "text": "This quiet period seems like a good time to reflect on the progress of [my trip goals](https://jwn.gr/microblog/2017-05-24) I'm pleased with my steady microblogging, l've done a decent job meeting people, and, outside of India, I've reached my step goal consistently. Meditation has been a mixed bag. I truly enjoy the reflection and relaxation it yields, but I've barely been doing it this past month. I practically never write down startup ideas, and I've only launched two projects, with another in progress. As I prepare to head back out on my travels, I need to improve my focus on creating."
    },
    "2017-07-26": {
      "locationId": "mechanicsburg",
      "text": "This week should be pretty quiet, so it's as good a time as any to dive into a topic I've been avoiding: why I left my life and job in San Francisco to travel the world. I had a good group of friends, a job that paid me more than I may ever make again, and generally enjoyed the Bay Area. Yet I felt so unhappy and unfulfilled, especially this past year. I've done a lot of reflecting and I'm finally able to consolidate my thoughts into a few 100 word chunks. But first, a mini road trip to Philly."
    },
    "2017-07-27": {
      "locationId": "philadelphia",
      "text": "Pish and I fought through rush hour traffic in Philadelphia, PA this evening to pick Crotty up from work. Those are two close friends from my high school soccer team who I've stayed in touch with over the years. Our reunions grow rarer each passing year, and a mid-summer get together is a special treat. After a rain-soaked Mexican meal, we spent the night sharing drinks and stories, filling each other in on the highs and lows since we last saw each other. We're three quite different people, but we share a common bond that means a lot to me."
    },
    "2017-07-28": {
      "locationId": "philadelphia",
      "text": "\"I thought we weren't supposed to cross the river?\" I'm looking questioningly at Pish, who appears deep in thought. We rented bikes a few miles back and have been riding along the Schuylkill River which cuts through Philly. A detour took us on an alternate route. Not that it matters much; we have no schedule. We'll drive home after the ride, deep in discussion about politics and religion. Pish is a good travel companion, often carrying conversations and unafraid to share his opinion on controversial or sensitive topics. I appreciate his candor, even if we don't agree about everything."
    },
    "2017-07-29": {
      "locationId": "mechanicsburg-2",
      "text": "I left Microsoft in mid-2014 to become employee #14 at [Firebase](https://firebase.google.com/), a San Francisco-based startup. I had grown tired of Microsoft's bureaucracy and slow pace and wanted larger ownership over my work. Startup life comprised long hours and high stress, but I was passionate about Firebase's mission and I made friends across the fast-moving team. Seven months later, Google acquired us. I was back at a big tech company. Despite this being a positive financial outcome, I was one of the few Firebasers unhappy to don my [Noogler hat](http://www.zdnet.com/article/10-weird-and-wonderful-things-you-didnt-know-about-google/). I knew things were about to change."
    },
    "2017-07-30": {
      "locationId": "mechanicsburg-2",
      "text": "I played tennis with Pish this afternoon. You know the frustration of hitting a simple volley directly into the net? It's similar to how I felt as time passed at Google. I held out hope for months that we'd operate like a startup within Google. But as the team grew and goalposts shifted, I felt pigeonholed, powerless to affect change outside my diminishing sphere of influence. At Firebase, I had the team's trust to contribute across the organization. At Google, I was a cog in a big machine, one I increasingly found difficult to support and get excited about."
    },
    "2017-07-31": {
      "locationId": "mechanicsburg-2",
      "text": "I was deeply invested in Firebase. The product, the people, the mission. But my frustrations grew and eventually seeped outside the office. My relationships with my then-girlfriend, my friends, and even myself started to deteriorate. I became uninterested in doing things that previously brought me joy. I needed to make a change. The idea of dropping everything and experiencing the world had always been there. This seemed like the time to do it, with no one depending on me, money saved up, and the flexibility to work from anywhere. So I quit, packed up my apartment, and said my goodbyes."
    },
    "2017-08-01": {
      "locationId": "mechanicsburg-2",
      "text": "I'm thankful for my time at Firebase. I gave everything I had and did good work there. And for that, I was well-rewarded. But I have zero regrets about leaving. I no longer wanted to trade happiness and time for money. And although I'm still recovering from work-induced burnout and I'm unsure of what lies beyond this worldwide trip, I'm now on the upswing. Success is irrelevant unless I'm pursuing the right things. Discovering those things is tantamount, and this trip is forcing me to revaluate what those are, something that would likely never have happened if I had stayed."
    },
    "2017-08-02": {
      "locationId": "mechanicsburg-2",
      "text": "I need to turn my consumption into production. With the second leg of my trip fast approaching, I’ve pondered how to get more done while abroad. I try stay informed by following world news, keeping tabs on the programming community, and reading blogs from founders and technologists I respect. But I could read about doing things forever without ever actually doing anything. So I’m going on a diet, a news and social media diet. I pruned my RSS feeds, unsubscribed from email newsletters, and am limiting myself to two 10 minute blocks of social media daily. Let's get to work!"
    },
    "2017-08-03": {
      "locationId": "mechanicsburg-2",
      "text": "My relationship with social media has deteriorated over the years. The signal-to-noise ratio is low, and trending lower. For every piece of useful advice, humorous anecdote, or meaning life update, there are dozens of posts filled with vitriol, spam, and opinions presented as facts. I consistently feel unhappier and more frustrated *after* spending time on social media, which isn’t how it always was. The current political climate certainly plays a role, but the virality of bad news and people's inclination to present a pristine, non-representative version of themselves online are also to blame. Time to wean myself off this addiction."
    },
    "2017-08-04": {
      "locationId": "mechanicsburg-2",
      "text": "Back into the unknown! I stopped by my sister’s house to read to and play games with my adorable niece, Audrey, before driving down to Baltimore with my dad to spend the rest of the day on a plane. My bag is a little lighter this time around, as I dropped some dead weight (goodbye GoPro camera) and replaced a few clothes with lighter alternatives. I also replenished my toiletries and gave everything - my bag included - a good cleaning. I catalogued my gear into a [traveling guide](https://docs.google.com/document/d/1WxOazKQk37f_57QT8HA2TbzWHO5POuwxPAxE47WfedQ/edit?usp=sharing), which may be useful for others embarking on a similar trip."
    },
    "2017-08-05": {
      "locationId": "brussels",
      "text": "It only took about two hours and a giant stuffed meatball eaten atop the cobblestone of [*Grote Markt*](https://en.wikipedia.org/wiki/Grand_Place) for me to realize how glad I am to be back in Europe. After a short layover in Iceland, I landed in [Brussels, Belgium](https://en.wikipedia.org/wiki/Brussels). The density of chocolate shops, waffle houses, [*frites*](https://en.wikipedia.org/wiki/French_fries) (\"fries\") stands, and beer halls is higher than I could've imagined, but you'll see no complaints about that from this guy. And despite the streets and buildings appearing to be straight out of medieval times, they are well-maintained and effective. Belgium feels like my kind of place!"
    },
    "2017-08-06": {
      "locationId": "brussels",
      "text": "I was fortunate to visit [Antwerp](https://en.wikipedia.org/wiki/Antwerp) on Sunday to experience the [*Vogelenmarkt*](https://nl.wikipedia.org/wiki/Vogelenmarkt) (\"Bird Market\"), a large outdoor market featuring a menagerie of foods, wares, and live animals. I spent an inordinate amount of time sampling dried sausages to figure out which three flavors to purchase. Fig, pepper, and the wildcard kangaroo were the winners. I complemented those sausages with nothing other than some more sausage, this time a giant food truck [currywurst](https://en.wikipedia.org/wiki/Currywurst). I plopped down on a bench on the outskirts of the market, sized up how to logistically eat what was in my hand, and took my first bite."
    },
    "2017-08-07": {
      "locationId": "brussels",
      "text": "A special visitor is joining me for a few days: [Andrew](https://twitter.com/startupandrew), Firebase co-founder and my manager while at Firebase and Google. Over that time, the two of us became good friends. I have a profound amount of respect for him, for what he built at Firebase, for the tough business and personnel decisions I saw him make, for always having my back throughout our entire working relationship. Both of us enjoyed our newfound freedom to talk with no work restrictions. Although he did fill me in on how my former co-workers were doing as I showed him around Brussels."
    },
    "2017-08-08": {
      "locationId": "brussels",
      "text": "Andrew and I packed our rain jackets, hopped aboard the train, and traded startup ideas the entire way to [Bruges](https://en.wikipedia.org/wiki/Bruges), a picturesque town in northern Belgium which is straight out of a fairy tale. We had plenty to talk about as we strolled alongside horse-drawn carriages, crisscrossing the town’s canal system. It’s refreshing to get feedback from him on where my mind is. He's been graciously imparting his knowledge about startups and the tech industry onto me. He can relate to what I'm thinking about and struggling with as he's been through similar experiences, thus providing me with invaluable mentorship."
    },
    "2017-08-09": {
      "locationId": "brussels",
      "text": "Brussels hosted the [1958 World’s Fair](https://en.wikipedia.org/wiki/Expo_58), the first held after World War II. Andrew and I visited the expo site, sauntering through the simultaneously cheesy and delightful [Mini Europe](https://en.wikipedia.org/wiki/Mini-Europe). We then ascended [Atomium](https://en.wikipedia.org/wiki/Atomium), a giant scale model of an iron crystal magnified 165 billion times. Everything felt straight out of the Jetsons, or maybe even Fallout. A chrome-clad future that turned out quite differently. It reminded me of a modern-day [World's Fair Nano](http://www.worldsfairusa.com/nano/sf/2016) I attended earlier this year, which involved much eye-rolling at the fantastical products. But I wonder what hindsight will reveal about that expo 60 years from now."
    },
    "2017-08-10": {
      "locationId": "amsterdam",
      "text": "Two noteworthy things happened on the bus ride to Amsterdam, Netherlands: (1) the Dutch border patrol pulled us over, resulting in heavily armed guards inspecting everyone's passports and (2) I finished [\"Listen, Liberal: Or, What Ever Happened to the Party of the People?\"](https://smile.amazon.com/dp/B012N992EK/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1). It details how the Democrats' betrayal of America's lower and middle classes in favor of Wall Street and Silicon Valley has helped accelerate income inequality as much as Republicans. As someone growing more politically conscious, it was a sobering look at how \"fixing things\" will take more than the Democrats simply winning back control. A probing read."
    },
    "2017-08-11": {
      "locationId": "amsterdam",
      "text": "It didn’t take long after Andrew and I said our goodbyes yesterday for me to join up with another travel partner: my sister, Hannah. We spent the day exploring Amsterdam, taking guided walking and boat tours and inching along for hours as we waited in line for the [Anne Frank House](https://en.wikipedia.org/wiki/Anne_Frank_House). We both found the latter experience strikingly memorable. Anne Frank’s life was treacherous, cut short by an evil regime who saw her as less than human. Undeterred, she lived her life as fully as possible, using her words to inspire millions and showing she was more human than most."
    },
    "2017-08-12": {
      "locationId": "amsterdam",
      "text": "Birthdays weren’t a huge deal growing up. The highlight was typically a family meal capped with a chocolate cake with chocolate icing and sprinkles. As I’ve gotten older, I aim to make birthdays more memorable. Today was Hannah’s birthday, her first abroad. We spent the morning successfully disarming a bomb at an escape room, followed by gorging ourselves on Dutch pancakes. We walked them off across several parks surrounding the city en route to view the masterpieces at the [Van Gogh Museum](https://en.wikipedia.org/wiki/Van_Gogh_Museum), finishing the day with *tapas*. I have a feeling this birthday will be a memorable one."
    },
    "2017-08-13": {
      "locationId": "berlin",
      "text": "In an ironic and distressing twist of fate, I found myself reading about deadly neo-Nazi gatherings back home in America on the same day as I visited sites across Berlin, Germany memorializing victims of the Holocaust and condemning the terrors of the Nazi movement. Sites recounting these horrific incidents in German history are prominently placed throughout the city, serving as public reminders, safeguards against history being repeated. Yet here we stand, with a growing movement of hate and prejudice in America spurred on by leaders who should be uniting us. We cannot forget. I will not forget."
    },
    "2017-08-14": {
      "locationId": "berlin",
      "text": "As we roam, Hannah and I find time to read quietly in parks. I just finished [\"Ready Player One,\"](https://smile.amazon.com/dp/B004J4WKUQ/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1) a much anticipated read given several recommendations and an upcoming Spielberg adaptation. The book is a scavenger hunt of sorts, set in a time when virtual reality supersedes actual reality and with a plot revolving around 1980’s video games and pop culture. It was a quick, intriguing read, but I was left underwhelmed. The brutalist dialogue was uncomfortable and the unrealistic ways characters solved puzzles made Dan Brown’s plots appear airtight. A good book which I was anticipating to be great."
    },
    "2017-08-15": {
      "locationId": "berlin",
      "text": "Hannah and I both fell face down onto our beds. A day walking the entirety of Potsdam had worn us out. But we enjoyed the change of scenery from Berlin, which is honestly kind of ugly. It lacks the charm of many other European cities. Ravaged by bombings in World War II, the city was rebuilt and thus features a lot of uninspired modern architecture. That's not to say Berlin is without beauty, but I prefer to stroll through the old palaces and neighborhoods of a place like Potsdam, which was not as heavily bombed during the war."
    },
    "2017-08-16": {
      "locationId": "berlin",
      "text": "Hannah and I have done a ton of sightseeing over the few days we've been in each city, resulting in a grueling pace of travel. I’m finding it hard to get anything else done, which is leaving me a bit uneasy. I certainly cannot keep this pace up for much longer. Thankfully, today was more laid back, including laundry and some quiet work time at a coffee shop before our evening flight. It's great to have a travel partner, but I feel guilty spending a day of their vacation doing something they could do anywhere. A good lesson to learn."
    },
    "2017-08-17": {
      "locationId": "stockholm",
      "text": "After a delayed flight and barely catching the last bus from the airport, my sister and I were greeted by our pajama-clad cousin Allie around 2 AM. Allie is currently living and working in Stockholm, Sweden, a picturesque waterside city Hannah and I spent the day exploring. We met up with Allie and her friends in the evening at a Swedish cultural festival, where I enjoyed a \"Fuck Trump\" food truck burger on the lawn of the Swedish parliament. Cultural festival indeed. Our night ended later with some homemade mead in a viking-inspired tavern straight out of *Game of Thrones*."
    },
    "2017-08-18": {
      "locationId": "stockholm",
      "text": "The view got better every passing minute aboard the *Cinderella I* as it navigated across the Swedish archipelago. The sun dropped slowly, coloring the sky as if with random colors pulled from a box of crayons. The three hour trip took Allie, her boyfriend Niklas, Hannah, and I to a cabin on the island of [Södermöja](https://www.google.dk/maps/place/S%C3%B6derm%C3%B6ja/@59.3963883,18.8411447,13.96z/data=!4m5!3m4!1s0x46f57021f3973cad:0x6cbedf83a6ffaec9!8m2!3d59.3993668!4d18.8579656), devoid of running water and equipped with outhouses out back. After so much time staying in big cities, it's refreshing to be out in the wilderness. If only I had remembered my bug spray for the nagging mosquitoes feasting on my legs."
    },
    "2017-08-19": {
      "locationId": "stockholm",
      "text": "The worst part wasn't leaping into the water, it was opening the sauna door, a rush of wind sliding over my sweaty skin. My teeth bit down. My hands tensed into fists. I quickstepped the slippery wooden walkway to the water's edge, not pausing for long before taking the plunge. My feet paused momentarily on the surprisingly shallow, pebble-covered bottom. I launched myself straight up, away from the cold, flopping in the air like a dying fish. I made quick work navigating the ladder and walkway back to the sauna door, the 140 degree heat a strangely welcome relief."
    },
    "2017-08-20": {
      "locationId": "stockholm",
      "text": "The early morning sun shone brightly in the living room of our second cabin of the weekend, this one on [Finnhamn](https://en.wikipedia.org/wiki/Finnhamn), a larger, less residential island we arrived at yesterday afternoon. A soreness in my throat notified me almost immediately of an oncoming cold. I somewhat surprisingly avoided sickness up to this point in my trip, even while in India. But my luck ran out, and I only partook in a portion of today's planned hikes. Being sick at home sucks, but it's even worse on the road, where sitting on your couch and watching Netflix isn't really an option."
    },
    "2017-08-21": {
      "locationId": "copenhagen",
      "text": "Allie concluded her gracious hosting of Hannah and I by sending us off with a pancake breakfast before we departed for the airport. I headed on to Copenhagen, Denmark; my sister back home to Chicago. Despite the occasional sibling bickering about this wrong turn or that incorrect dessert selection, we'd make a good duo on *The Amazing Race*. She's addicted to [my daily step goal](https://jwn.gr/microblog/2017-05-25), which we hit each day. And although I know she's ready to sleep in her own bed and I'm relieved to only have to entertain myself again, I'll treasure these past two weeks we shared."
    },
    "2017-08-22": {
      "locationId": "copenhagen",
      "text": "It didn't take long to remember how hostel life feels, with one of my nine roommates shaking the earth with his 4 AM snoring. I put on my headphones and got some sleep, doing what I could to fight back this cold. It was my first full day on my own in several weeks, one I spent doing some sightseeing (oh hey, [*Little Mermaid*](https://en.wikipedia.org/wiki/The_Little_Mermaid_(statue))), but mostly just catching up on trip and life planning. I'm not currently in the best work mindset, but I've got some down time these next few days and plan to make the most of them."
    },
    "2017-08-23": {
      "locationId": "copenhagen",
      "text": "\"Why would you ever do that? Isn’t that supposed to be like the best place to work?\" Quitting my job at Google has been a common topic of discussion for people I've met abroad. Not everyone grasps where I'm coming from, thinking it's unfathomable to be unhappy at a place where you get free meals and can take midday nap in sleeping pods. I unsuccessfully explain how leaving was the best decision for myself. I'm sitting on a lot of unknowns, but I'm much happier today than I was a year ago, which means I'm headed in the right direction."
    },
    "2017-08-24": {
      "locationId": "copenhagen",
      "text": "Copenhagen has an unbelievably vibrant food scene, highlighted by two distinctly different food halls, [Torvehallerne](https://torvehallernekbh.dk/) and [Copenhagen Street Food](http://copenhagenstreetfood.dk/en/). I've indulged in BBQ ([Warpigs](http://warpigs.dk/eat-drink/)), tacos ([Hija de Sanchez](http://www.hijadesanchez.dk/)), Brazilian *rodizio* ([Brasa](http://copenhagenstreetfood.dk/en/stade/brasa/)), chocolate-covered cinnamon rolls ([Lauras](http://laurasbakery.com/)), duck confit ([Ma Poule](http://www.visitcopenhagen.com/copenhagen/ma-poule-torvehallerne-gdk794135)), and some excellent beer. Oh, and a [crème brûlée donut](http://imgur.com/gallery/N3Xvci9) encrusted in crystalized sugar using a blowtorch. The only downside has been on my wallet, as Copenhagen’s 25% food tax results in some vendors charging $20 for a main dish. But they wouldn’t survive long charging high prices for mediocre food. The result is a city brimming with quality dining options."
    },
    "2017-08-25": {
      "locationId": "porto-2",
      "text": "I've returned to Porto, one of my favorite stops on the trip so far. I'm here to see Germana, who you may remember from [an earlier post](https://jwn.gr/microblog/2017-05-28). We've stayed in touch since that night, making plans to reunite. We recreated our first night together, starting with some port wine across the Douro River in Gaia. Midnight quickly passed as we lost track of time, deep in conversation similar to that which made us quick companions. Even the Portuguese restaurants were closed as we searched for food. Time is a fickle thing; it weighs most on those who have it least."
    },
    "2017-08-26": {
      "locationId": "porto-2",
      "text": "[Guimarães](https://en.wikipedia.org/wiki/Guimar%C3%A3es) is considered the birthplace of Portugal, a UNESCO World Heritage Site with charming plazas and a castle which defended the city many centuries ago. Germana and I took our time exploring the small downtown area, visiting churches, sharing traditional (that is, heavily fried) Portuguese tapas, and laying on the grass together to dodge the midday sun. We then headed high above the city to Penha Park, littered with moss-covered boulders the size of vans that were as splendid as they were unexpected. Quaint is the best word to describe the town of Guimarães, and to describe this day."
    },
    "2017-08-27": {
      "locationId": "porto-2",
      "text": "\"Are you boyfriend and girlfriend?\" Germana and I exchange a quick glance and an uncomfortable, but suggestive smile. “No, just friends,” I tell the little girl we just recently met. We're having lunch with six strangers, in the midst of a day tasting wine, olive oil, and honey in Portugal’s Douro Valley. There’s something to the directness of her question. The people I've most enjoyed meeting and talking to lately are those who, like this little girl, don't mince their words. I much prefer the sincerity behind awkward questions and equally uncomfortable answers to the superficiality of most everyday conversations."
    },
    "2017-08-28": {
      "locationId": "porto-2",
      "text": "Life sometimes feels like a giant balancing act, hedging one bet against another. Defenses constructed to temper life's lows simultaneously dampen its highs. Yet a fully realized loving friendship or romantic relationship requires vulnerability. A crushing right hook directly to the face is sometimes a potential hazard to experience that feeling you hear people singing about on the radio. Constantly guarding oneself against possible - or even probable - negative outcomes comes at a high cost. The me of one year ago would not have made this trip to Porto; the me of today is overjoyed that I did."
    },
    "2017-08-29": {
      "locationId": "milan",
      "text": "A single photo cannot adequately portray the sheer size of the [Duomo di Milano](https://en.wikipedia.org/wiki/Milan_Cathedral), an imposing marble structure covered in intricate sculptures which are each impressive works of art in their own right. Today's tour around Milan was with my former San Francisco roommate, Mythila, and her Italian boyfriend, Edoardo. Although just 8.3% Italian, I've inherited a love for Italian cuisine. My previous Italian excursion was highlighted by one of the best meals of my life in a tiny restaurant in Pisa. Tonight's pasta dish may have topped that mark, one I hope to again surpass in the coming weeks."
    }
  }
}
